ИИ_Агент/src/Enums/ИИА_ТипСообщения/ИИА_ТипСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИИА_ТипСообщения</name>
  <enumValues>
    <name>Текст</name>
  </enumValues>
  <enumValues>
    <name>Запрос</name>
  </enumValues>
  <enumValues>
    <name>Код</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

ИИ_Агент/src/Enums/ИИА_АвторСообщения/ИИА_АвторСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИИА_АвторСообщения</name>
  <enumValues>
    <name>Пользователь</name>
  </enumValues>
  <enumValues>
    <name>ИИ</name>
  </enumValues>
  <enumValues>
    <name>Система</name>
  </enumValues>
</mdclass:Enum>

ИИ_Агент/src/Catalogs/ИИА_Диалоги/ИИА_Диалоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИИА_Диалоги</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДиалога</name>
    <type>
      <types>EnumRef.ИИА_ТипДиалога</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Активный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сообщения</name>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>EnumRef.ИИА_АвторСообщения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСообщения</name>
      <type>
        <types>EnumRef.ИИА_ТипСообщения</types>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстКода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UsageTokens</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИИ_Агент/src/CommonModules/ИИА_Сервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Получает настройки пользователя из регистра сведений
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - пользователь, для которого получить настройки
//
// Возвращаемое значение:
//  Структура - структура с настройками:
//   * РежимПодключения - ПеречислениеСсылка.ИИА_РежимПодключения
//   * Gitsell_Endpoint - Строка
//   * Gitsell_AccessToken - Строка
//   * Provider_BaseURL - Строка
//   * Provider_ApiKey - Строка
//   * ProviderType - Строка
//
Функция ПолучитьНастройкиПользователя(Пользователь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("РежимПодключения", Неопределено);
	Результат.Вставить("Gitsell_Endpoint", "");
	Результат.Вставить("Gitsell_AccessToken", "");
	Результат.Вставить("Provider_BaseURL", "");
	Результат.Вставить("Provider_ApiKey", "");
	Результат.Вставить("ProviderType", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПользователя.РежимПодключения,
	|	НастройкиПользователя.Gitsell_Endpoint,
	|	НастройкиПользователя.Gitsell_AccessToken,
	|	НастройкиПользователя.Provider_BaseURL,
	|	НастройкиПользователя.Provider_ApiKey,
	|	НастройкиПользователя.ProviderType
	|ИЗ
	|	РегистрСведений.ИИА_НастройкиПользователя КАК НастройкиПользователя
	|ГДЕ
	|	НастройкиПользователя.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Результат.РежимПодключения = Выборка.РежимПодключения;
	Результат.Gitsell_Endpoint = Выборка.Gitsell_Endpoint;
	Результат.Gitsell_AccessToken = Выборка.Gitsell_AccessToken;
	Результат.Provider_BaseURL = Выборка.Provider_BaseURL;
	Результат.Provider_ApiKey = Выборка.Provider_ApiKey;
	Результат.ProviderType = Выборка.ProviderType;
	
	Возврат Результат;
	
КонецФункции

// Находит активный диалог пользователя или создает новый
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - пользователь
//
// Возвращаемое значение:
//  СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//
Функция НайтиИлиСоздатьДиалогПользователя(Пользователь) Экспорт
	
	// Ищем активный диалог
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Диалоги.Ссылка
	|ИЗ
	|	Справочник.ИИА_Диалоги КАК Диалоги
	|ГДЕ
	|	Диалоги.Пользователь = &Пользователь
	|	И Диалоги.Активный = ИСТИНА
	|УПОРЯДОЧИТЬ ПО
	|	Диалоги.ДатаСоздания УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	// Создаем новый диалог
	НовыйДиалог = Справочники.ИИА_Диалоги.СоздатьЭлемент();
	НовыйДиалог.Пользователь = Пользователь;
	НовыйДиалог.Имя = "Диалог ИИ от " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy HH:mm:ss");
	НовыйДиалог.ДатаСоздания = ТекущаяДата();
	НовыйДиалог.Активный = Истина;
	НовыйДиалог.Записать();
	
	Возврат НовыйДиалог.Ссылка;
	
КонецФункции

// Получает сообщения диалога
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  Количество - Число - количество последних сообщений
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с сообщениями
//
Функция ПолучитьСообщенияДиалога(СсылкаДиалога, Количество = 50) Экспорт
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Время", Новый ОписаниеТипов("ДатаВремя"));
	Таблица.Колонки.Добавить("Автор", Новый ОписаниеТипов("ПеречислениеСсылка.ИИА_АвторСообщения"));
	Таблица.Колонки.Добавить("ТипСообщения", Новый ОписаниеТипов("ПеречислениеСсылка.ИИА_ТипСообщения"));
	Таблица.Колонки.Добавить("Текст", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ТекстКода", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Статус", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("UsageTokens", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 0)));
	
	ИндексНачала = Макс(0, Диалог.Сообщения.Количество() - Количество);
	
	Для Индекс = ИндексНачала По Диалог.Сообщения.Количество() - 1 Цикл
		
		Строка = Диалог.Сообщения[Индекс];
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Время = Строка.Время;
		НоваяСтрока.Автор = Строка.Автор;
		НоваяСтрока.ТипСообщения = Строка.ТипСообщения;
		НоваяСтрока.Текст = Строка.Текст;
		НоваяСтрока.ТекстКода = Строка.ТекстКода;
		НоваяСтрока.Статус = Строка.Статус;
		НоваяСтрока.UsageTokens = Строка.UsageTokens;
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

// Добавляет сообщение в диалог
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  Автор - ПеречислениеСсылка.ИИА_АвторСообщения - автор сообщения
//  ТипСообщения - ПеречислениеСсылка.ИИА_ТипСообщения - тип сообщения
//  Текст - Строка - текст сообщения
//  ТекстКода - Строка - текст кода (для запросов)
//  Статус - Строка - статус сообщения
//  UsageTokens - Число - количество использованных токенов
//
Процедура ДобавитьСообщениеВДиалог(СсылкаДиалога, Автор, ТипСообщения, Текст, ТекстКода = "", Статус = "", UsageTokens = 0) Экспорт
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	
	НоваяСтрока = Диалог.Сообщения.Добавить();
	НоваяСтрока.Время = ТекущаяДата();
	НоваяСтрока.Автор = Автор;
	НоваяСтрока.ТипСообщения = ТипСообщения;
	НоваяСтрока.Текст = Текст;
	НоваяСтрока.ТекстКода = ТекстКода;
	НоваяСтрока.Статус = Статус;
	НоваяСтрока.UsageTokens = UsageTokens;
	
	Диалог.Записать();
	
КонецПроцедуры

// Вызывает ИИ для получения ответа (заглушка)
//
// Параметры:
//  ТипСообщения - Строка - тип сообщения ("Чат" или "Запрос")
//  ТекстПользователя - Строка - текст от пользователя
//  История - ТаблицаЗначений - история сообщений
//  Настройки - Структура - настройки пользователя
//
// Возвращаемое значение:
//  Структура - структура ответа:
//   * ТипОтвета - Строка ("Текст" или "Запрос")
//   * Текст - Строка - текст ответа
//   * Запрос - Строка - текст запроса (для типа "Запрос")
//   * Usage - Структура - информация об использовании токенов
//   * Ошибки - ОписаниеОшибки - информация об ошибках
//
Функция ВызватьИИ(ТипСообщения, ТекстПользователя, История, Настройки) Экспорт
	
	// Заглушка - возвращаем тестовый ответ
	Результат = Новый Структура;
	Результат.Вставить("ТипОтвета", "Текст");
	Результат.Вставить("Текст", "");
	Результат.Вставить("Запрос", "");
	Результат.Вставить("Usage", Неопределено);
	Результат.Вставить("Ошибки", Неопределено);
	
	Если ТипСообщения = "Запрос" Тогда
		
		// Для режима запроса генерируем тестовый запрос
		Результат.ТипОтвета = "Запрос";
		Результат.Запрос = "ВЫБРАТЬ * ИЗ Справочник.ИИА_Диалоги";
		Результат.Текст = "Сгенерирован запрос:";
		
	Иначе
		
		// Для обычного чата
		Результат.Текст = "Это тестовый ответ ИИ. Настройте подключение к реальному API для работы с ИИ.";
		
	КонецЕсли;
	
	// Создаем структуру Usage (заглушка)
	UsageStruct = Новый Структура;
	UsageStruct.Вставить("PromptTokens", 0);
	UsageStruct.Вставить("CompletionTokens", 0);
	UsageStruct.Вставить("TotalTokens", 0);
	UsageStruct.Вставить("ОстатокКредитов", 0);
	Результат.Usage = UsageStruct;
	
	Возврат Результат;
	
КонецФункции

// Отправляет сообщение и получает ответ от ИИ
//
// Параметры:
//  СсылкаДиалога - СправочникСсылка.ИИА_Диалоги - ссылка на диалог
//  ТипСообщения - Строка - тип сообщения ("Чат" или "Запрос")
//  ТекстПользователя - Строка - текст от пользователя
//
// Возвращаемое значение:
//  Структура - структура ответа от ВызватьИИ
//
Функция ОтправитьСообщениеСервера(СсылкаДиалога, ТипСообщения, ТекстПользователя) Экспорт
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	Пользователь = Диалог.Пользователь;
	
	// Получаем настройки пользователя
	Настройки = ПолучитьНастройкиПользователя(Пользователь);
	
	// Загружаем историю диалога
	История = ПолучитьСообщенияДиалога(СсылкаДиалога, 10);
	
	// Определяем тип сообщения для хранения
	Если ТипСообщения = "Запрос" Тогда
		ТипСообщенияДляХранения = Перечисления.ИИА_ТипСообщения.Запрос;
	Иначе
		ТипСообщенияДляХранения = Перечисления.ИИА_ТипСообщения.Текст;
	КонецЕсли;
	
	// Добавляем сообщение пользователя
	ДобавитьСообщениеВДиалог(
		СсылкаДиалога,
		Перечисления.ИИА_АвторСообщения.Пользователь,
		ТипСообщенияДляХранения,
		ТекстПользователя
	);
	
	// Вызываем ИИ
	ОтветИИ = ВызватьИИ(ТипСообщения, ТекстПользователя, История, Настройки);
	
	// Определяем тип ответа для хранения
	Если ОтветИИ.ТипОтвета = "Запрос" Тогда
		ТипСообщенияОтвета = Перечисления.ИИА_ТипСообщения.Запрос;
		ТекстОтвета = ОтветИИ.Текст;
		ТекстКодаОтвета = ОтветИИ.Запрос;
	Иначе
		ТипСообщенияОтвета = Перечисления.ИИА_ТипСообщения.Текст;
		ТекстОтвета = ОтветИИ.Текст;
		ТекстКодаОтвета = "";
	КонецЕсли;
	
	// Получаем UsageTokens
	UsageTokens = 0;
	Если ОтветИИ.Usage <> Неопределено Тогда
		UsageTokens = ОтветИИ.Usage.TotalTokens;
	КонецЕсли;
	
	// Добавляем ответ ИИ
	ДобавитьСообщениеВДиалог(
		СсылкаДиалога,
		Перечисления.ИИА_АвторСообщения.ИИ,
		ТипСообщенияОтвета,
		ТекстОтвета,
		ТекстКодаОтвета,
		"",
		UsageTokens
	);
	
	Возврат ОтветИИ;
	
КонецФункции

// Проверяет запрос 1С на выполнимость
//
// Параметры:
//  ТекстЗапроса - Строка - текст запроса
//
// Возвращаемое значение:
//  Структура - структура результата:
//   * Успех - Булево - успешность выполнения
//   * Сообщение - Строка - текст ошибки или пусто
//
Функция ПроверитьЗапрос(ТекстЗапроса) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("Сообщение", "");
	
	Попытка
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.Выполнить();
		
		Результат.Успех = Истина;
		
	Исключение
		
		Результат.Сообщение = ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
